[
	{
		"id": "86",
		"date": "May 2024",
		"name": "Carol",
		"content": "Owl Cottage was just perfect for our 4 night stay to explore the area. Spotlessly clean, lovely bed linen and towels, exceptional kitchen equipment. We have stayed in many holiday lets over the years and Owl Cottage has been one of the best... the attention to detail to make your stay comfortable was exceptional. Thank you Jane for a wonderful stay."
	},
	{
		"id": "86",
		"date": "May 2024",
		"name": "Tanya",
		"content": "My second stay at Owl Cottage. Such a lovely property, good base for lots of exploring. Will definitely be back."
	},
	{
		"id": "85",
		"date": "April 2024",
		"name": "Kelly"
	},
	{
		"id": "84",
		"date": "April 2024",
		"name": "Jenna",
		"content": "Fantastic accommodation just perfect for our stay in the highlands. Owl cottage is a beautiful home away from home with everything you could think of for a holiday away. A perfect comfy, cosy cottage. We all loved it! Thank you."
	},
	{
		"id": "83",
		"date": "March 2024",
		"name": "Helen"
	},
	{
		"id": "82",
		"date": "March 2024",
		"name": "Emily",
		"content": "Perfect, peaceful and relaxing!"
	},
	{
		"id": "81",
		"date": "March 2024",
		"name": "Nicholas",
		"content": "A lovely clean home from home. The property had everything we could have needed for a week away. Easy to control heating which made staying there such a pleasure. Loved the blankets so our furry friend could relax next to us to after a busy day discovering Scotland . A truly lovey place to stay."
	},
	{
		"id": "80",
		"date": "March 2024",
		"name": "Bridget",
		"content": "We all enjoyed an absolutely amazing time at Owl Cottage, our doggies loved the peaceful serenity of the fully enclosed garden and spent most of their time chilling outside. The cottage is very well equipped and has a truly lovely ambiance. We are looking forward to visiting again in the near future 😊."
	},
	{
		"id": "79",
		"date": "March 2024",
		"name": "Gabriella"
	},
	{
		"id": "78",
		"date": "February 2024",
		"name": "Susy"
	},
	{
		"id": "77",
		"date": "February 2024",
		"name": "Paula"
	},
	{
		"id": "76",
		"date": "January 2024",
		"name": "Dani",
		"content": "Jane couldn't have offered us a nicer place to stay. Communication was fantastic, the home is really well equipped, it was warm and cozy, especially when we lit the fire! Our puppy loved being able to run about in house and garden."
	},
	{
		"id": "75",
		"date": "January 2024",
		"name": "Marta",
		"content": "Absolutely amazing place worth every single penny. Cottage is exactly as described if not better. So clean and has everything you need. Jane is also so quick to respond to any questions and we couldn't of been happier with our stay! Highly recommend to anyone."
	},
	{
		"id": "74",
		"date": "December 2023",
		"name": "Georgia",
		"content": "We stayed at Jane's place for 4 nights with a dog. The property is super cozy and kitted out with absolutely everything you need - including basic kitchen supplies, doggy bed/treats and a full starter pack for the log burner. It's cold in Dec but when I arrived late Sunday Jane had made sure the place was warm and well lit. The place was clean, modern and beautifully furnished. I worked remotely all week and the wifi was superb - no issues. There are lots of walks nearby and outdoor space around the property for a dog. You will need to drive to get to walking spots as no footpaths along the main roads. A faultless stay, thank you!"
	},
	{
		"id": "73",
		"date": "December 2023",
		"name": "Ann",
		"content": "We stayed at Owl Cottage for a few days. It's an absolutely beautiful cottage with everything you need. The added extras were welcomed such as coffee pods and a few logs for the fire. The beds are really comfortable. We have dogs, therefore the enclosed garden was perfect. I'd definitely recommend a visit."
	},
	{
		"id": "72",
		"date": "December 2023",
		"name": "Kirsty",
		"content": "We had a wonderful stay here with our dog. Peaceful and relaxing with everything you need in a home away from home. Very tastefully decorated and lovely and warm inside. Loved all the extra dog blankets so that our pup could feel at home, too! Would happily recommend!"
	},
	{
		"id": "71",
		"date": "November 2023",
		"name": "George",
		"content": "Owl Cottage is a very cosy comfortable place to stay and a great base to explore and enjoy the local area. Loads to do and see locally. Highly recommended!"
	},
	{
		"id": "70",
		"date": "November 2023",
		"name": "Tracy",
		"content": "We have had a fantastic time away this Autumn, such a lot to see and do. Owl cottage was warm and cozy, plenty of space for us and our dogs. Set back off the road and quiet. The power shower was a treat after a day out and about. The Falls of Foyer was not too far away but a good hike down to Loch Ness and back up. The wee cafe was perfect for a late lunch and coffee. Glenfinnin is a must visit!!! The Harry Potter train is fantastic to see!! Ben Nevis visitor centre didn't disappoint, the cable car up to the lookout area and ski cafe was fun. All in all a wonderful holiday in the highlands!! And each night to return to a warm cottage to make dinner and sit in front of the fire was a treat!!!"
	},
	{
		"id": "69",
		"date": "October 2023",
		"name": "Lyn",
		"content": "Once again a superb stay at Owl Cottage where Jane has gone the extra mile to make sure everything you could possibly need is on tap. It's pristine, comfortable and extremely well equipped; it's also perfectly placed for exploring one of the most spectacular parts of Scotland - we still haven't run out of fabulous walks to do - we're already planning when we'll be back again!"
	},
	{
		"id": "68",
		"date": "October 2023",
		"name": "Louise",
		"content": "Great host and wonderful accommodation!"
	},
	{
		"id": "67",
		"date": "September 2023",
		"name": "Marion",
		"content": "Very clean and very spacious cottage, if you are looking for tranquility and a typical place of the highlands this is the accommodation you need! This cottage in the middle of nature and close to Fort Augustus was the place we were looking for when we wanted to do our roadtrip in Scotland. Jane is responsive when sent a message. Only drawback may be, a connection that is unstable, but is consistent with the place!"
	},
	{
		"id": "66",
		"date": "September 2023",
		"name": "Ellena"
	},
	{
		"id": "65",
		"date": "September 2023",
		"name": "Wolter",
		"content": "The place was great and had everything we needed. The only thing that we would like to have seen better was the internet but that is understandably very difficult to do well in such a remote place."
	},
	{
		"id": "64",
		"date": "August 2023",
		"name": "Ava"
	},
	{
		"id": "63",
		"date": "August 2023",
		"name": "Erin"
	},
	{
		"id": "62",
		"date": "August 2023",
		"name": "Jennifer",
		"content": "Beautiful cottage, absolutely perfect for dogs and humans. Close enough to shops and ‘things to do’ but far enough to feel like we were in the middle of nowhere. Exactly what we needed."
	},
	{
		"id": "61",
		"date": "August 2023",
		"name": "Steven",
		"content": "Would recommend Owl Cottage! The whole family loved it. My 3 year old daughter wanted to “stay at Owl Cottage forever”. It was a nice place to relax and spend time in, but also well placed to explore the surrounding areas. Jane was very responsive and helpful. If going with dogs would recommend the jaggy thistle for breakfast and the whitebridge hotel for dinner."
	},
	{
		"id": "60",
		"date": "August 2023",
		"name": "Yohann",
		"content": "Superb stay in Jane's cottage, perfect for a family of 4, very well equipped, very comfortable, quiet, a high quality service!"
	},
	{
		"id": "59",
		"date": "August 2023",
		"name": "Gino",
		"content": "Great place to stay!"
	},
	{
		"id": "58",
		"date": "July 2023",
		"name": "Yu-Ting",
		"content": "Everything was very lovely in the house - we really enjoyed our stay!"
	},
	{
		"id": "57",
		"date": "July 2023",
		"name": "Jenny",
		"content": "The place was wonderful and there was information material ready for us. Everything was available and communication with Jane went smoothly. Unfortunately, the apartment is on a main road and there is no footpath to the nearest neighboring village. I would definitely recommend it. Thank you for the lovely holiday 😊"
	},
	{
		"id": "56",
		"date": "July 2023",
		"name": "James",
		"content": "As described and a comfortable cottage that easily accommodated 4, plus a dog."
	},
	{
		"id": "55",
		"date": "July 2023",
		"name": "Lesley",
		"content": "Lovely property, very pet friendly."
	},
	{
		"id": "54",
		"date": "June 2023",
		"name": "Judith"
	},
	{
		"id": "53",
		"date": "June 2023",
		"name": "Paul",
		"content": "Nice place, worked well for my family."
	},
	{
		"id": "52",
		"date": "June 2023",
		"name": "Tanya",
		"content": "Just got back from a couple of days in Jane's cottage and all I can say is wow. The place is immaculate and had everything we needed. the dogs had a wonderful time in the garden which is really secure ,they even met the neighbour. everything is within easy driving distance and Fort Augustus has all you need for a few days sightseeing. culloden Moor is about an hour away and really worth the drive as is InvernessThe local Spar shop has everything you need for local produce. Will be booking again for next year."
	},
	{
		"id": "51",
		"date": "June 2023",
		"name": "Emma"
	},
	{
		"id": "50",
		"date": "May 2023",
		"name": "Anne",
		"content": "We had the opportunity to stay for a few days in this spacious and pleasantly located accommodation. From the house, you could explore in any direction, and it was centrally located in beautiful nature."
	},
	{
		"id": "49",
		"date": "May 2023",
		"name": "Jan",
		"content": "The accommodation is highly recommended. Everything you need. Garden super suitable for a dog. Accommodation is very well-equipped and is centrally located for various activities by car within an hour."
	},
	{
		"id": "48",
		"date": "May 2023",
		"name": "Jan"
	},
	{
		"id": "47",
		"date": "April 2023",
		"name": "Lyn",
		"content": "Absolutely superb. Fabulous, tasteful, pristine accommodation with everything you could possibly need, in the perfect spot for the most amazing walks and scenery. Can't wait to come again!"
	},
	{
		"id": "46",
		"date": "April 2023",
		"name": "Louise"
	},
	{
		"id": "45",
		"date": "April 2023",
		"name": "Kathryn",
		"content": "This cottage is just lovely. Roomier inside than you expect and well located for local activities. It is well equipped, beds are comfy and it is spotlessly clean. Definitely book."
	},
	{
		"id": "44",
		"date": "April 2023",
		"name": "Dani"
	},
	{
		"id": "43",
		"date": "April 2023",
		"name": "Phil"
	},
	{
		"id": "42",
		"date": "March 2023",
		"name": "Catriona",
		"content": "Really great little cottage it had everything we could have asked for. It was great be able to let the dog wander about without worrying where she was in the house. Great living space, bed was lovely, big and comfy. Kitchen/dining/living area was nice and spacious and great for meal times and games too. If in the area again will definitely book again."
	},
	{
		"id": "41",
		"date": "February 2023",
		"name": "Graham",
		"content": "I would highly recommend Janes cottage."
	},
	{
		"id": "40",
		"date": "February 2023",
		"name": "Grant",
		"content": "Lovely place, warm, spacious yet cosy. The garden was perfect for dogs. Kitchen, dining and front room layout was perfect for family meals and board games. Close to many beautiful walks, the cottage was well equipped, with a log burner. the home was lovely and warm. 6 mins drive to shop which had most things. Great pub in Fort Augustus. We had a wonderful peaceful stay."
	},
	{
		"id": "39",
		"date": "January 2023",
		"name": "Jenny & Myshkin",
		"content": "We love this beautiful place! We are so grateful that we found it, l it had everything we needed. Jane is a wonderful host."
	},
	{
		"id": "38",
		"date": "January 2023",
		"name": "Laura"
	},
	{
		"id": "37",
		"date": "November 2022",
		"name": "Christina",
		"content": "Lovely, comfortable home, good communication and east check in. Lovely area to stay in with lots to do nearby. Would definitely recommend to stay here."
	},
	{
		"id": "36",
		"date": "November 2022",
		"name": "Ben",
		"content": "The perfect place to relax and switch off from city life. The cottage was beautifully presented and we felt right at home. Our dog Mabel loved it too. The enclosed garden out the back was perfect for her. Would definitely recommend and would stay again!"
	},
	{
		"id": "35",
		"date": "November 2022",
		"name": "Marie",
		"content": "Owl Cottage is a top notch accommodation. It is spacious, pristine and thoughtfully laid out. Jane provides good quality bedding and a very comfortable mattress to ensure a great sleep. The kitchen is so well equipped and will please all avid cooks, with a lovely large oven and a good assortments of pots and pans. 100 percent recommend Owl Cottage!"
	},
	{
		"id": "34",
		"date": "November 2022",
		"name": "Elodie",
		"content": "Great stay at this very cozy cottage. Jane is very responsive and replies quickly to messages. Recommended!"
	},
	{
		"id": "33",
		"date": "October 2022",
		"name": "Kevin"
	},
	{
		"id": "32",
		"date": "October 2022",
		"name": "Chris",
		"content": "Lovely cottage just a short drive from Fort Augustus. Would highly recommend for a family and the fact that it's dog friendly is a real plus."
	},
	{
		"id": "31",
		"date": "October 2022",
		"name": "Kirstie",
		"content": "A lovely cottage with everything we needed to relax, in between exploring the local area... just great!"
	},
	{
		"id": "30",
		"date": "October 2022",
		"name": "Neil",
		"content": "Excellent cottage all finished off to a high standard, ideally situated between Inverness and Fort William. Even though it's near a main road, there is very little road traffic 3 miles from Fort Augustus."
	},
	{
		"id": "29",
		"date": "September 2022",
		"name": "Alysha"
	},
	{
		"id": "28",
		"date": "September 2022",
		"name": "Natalie"
	},
	{
		"id": "27",
		"date": "September 2022",
		"name": "Katie",
		"content": "We had a great stay with our family and having the dogs be able to access everywhere securely was just amazing and took any stress out of being away from home for them!"
	},
	{
		"id": "26",
		"date": "September 2022",
		"name": "Susan",
		"content": "A comfy cottage, don't be put off as we nearly were that there are no walks from the door, a 10-minute drive and there are plenty. We had everything we needed and the scenery is just stunning."
	},
	{
		"id": "25",
		"date": "September 2022",
		"name": "Rob",
		"content": "Owl cottage was a great base for our daily outings, we would recommend it to anyone that's looking for an active break."
	},
	{
		"id": "24",
		"date": "August 2022",
		"name": "Tom"
	},
	{
		"id": "23",
		"date": "August 2022",
		"name": "Martin"
	},
	{
		"id": "22",
		"date": "August 2022",
		"name": "Paula",
		"content": "Owl cottage is the best cottage we've stayed at for a long time! 10/10 for everything and an ideal spot to explore Loch Ness and beautiful villages on the way to Inverness! 🏴󠁧󠁢󠁳󠁣󠁴󠁿"
	},
	{
		"id": "21",
		"date": "August 2022",
		"name": "Erin",
		"content": "Great cottage, so airy, spacious and comfy. Everything you need there to call it a home from home for your stay. Our sons highlight was the 4 fighter jets in training that flew past the cottage on Tuesday morning. Lovely comfy super king sized bed. Really enjoyed our stay and have booked a return visit. communication with Jane has been great, self checkin super easy and cottage was lovely and clean with Tunnocks teacakes, milk, tea and coffee to greet us. Thank you."
	},
	{
		"id": "20",
		"date": "July 2022",
		"name": "Nina",
		"content": "Beautiful Cottage. Absolutely spotless. Superb quality fixtures and fittings. Jane went out of her way to ensure our stay was outstanding. Stunning area."
	},
	{
		"id": "19",
		"date": "July 2022",
		"name": "Alice",
		"content": "Wow! Such a lovely place to stay. You definitely wouldn't know from noise that you're on a main road but makes the cottage ideal when trying to get to places. So well equipped, very clean and just all round so comfortable. Thank you for having us - we will be back for sure :)"
	},
	{
		"id": "18",
		"date": "July 2022",
		"name": "Lynsey"
	},
	{
		"id": "17",
		"date": "July 2022",
		"name": "William",
		"content": "My wife, our two dogs and I have just got back from spending a week at Owl Cottage. We loved everything about it. Such a beautiful cottage in idyllic surroundings. We loved the open plan kitchen and living area and even though it mentions occasional traffic noise in the description, we didn't notice it as the road isn't busy. The Cottage was cleaned to a high standard and had all the facilities and cooking equipment we needed. We were very happy there and we can't fault it at all. It was the perfect place for us to explore the Highlands with Fort Augustus and Loch Ness only 5 minutes drive away and so many walks exploring the beautiful surroundings a short distance away too. The garden was great for the dogs and was all enclosed so they were quite happy roaming around. Jane is a great host with brilliant communication and made our stay very easy. I'd highly recommend staying at Owl Cottage and we will definitely be back to stay again."
	},
	{
		"id": "16",
		"date": "June 2022",
		"name": "Emma"
	},
	{
		"id": "15",
		"date": "June 2022",
		"name": "Neil"
	},
	{
		"id": "14",
		"date": "June 2022",
		"name": "Joanne",
		"content": "We had a great stay in this wonderful dog friendly cottage. We took three dogs and it was perfect for them with a lovely enclosed garden (the fence is high enough for our terriers not to scale but we didn't leave our young collie unattended in the garden just in case!) and wooden floors throughout. There isn't any walking from the cottage but there are some fabulous walks a short drive away (including one along the Caledonian canal about 5 mins drive away which was great for the dogs!)"
	},
	{
		"id": "13",
		"date": "June 2022",
		"name": "Tanya"
	},
	{
		"id": "12",
		"date": "May 2022",
		"name": "James"
	},
	{
		"id": "11",
		"date": "May 2022",
		"name": "Kieth",
		"content": "A great spacious, but cosy, get away from it all. Would definitely stay again."
	},
	{
		"id": "10",
		"date": "May 2022",
		"name": "Jozie",
		"content": "Beautifully presented cottage in the heart of the Highlands. Super dog friendly, the perfect place for a relaxing getaway."
	},
	{
		"id": "9",
		"date": "May 2022",
		"name": "Sam",
		"content": "Loved the house. Beautiful on inside and out. Would visit again. Perfectly located for Loch Ness and Ben Nevis. An old property but still very modern."
	},
	{
		"id": "8",
		"date": "April 2022",
		"name": "Steve",
		"content": "A great cottage - well equipped and beautifully furnished. Also ideal if you have dogs-wooden floors and an enclosed garden. We found it a good central position for our first visit to the Highlands. We would definitely recommend it."
	},
	{
		"id": "7",
		"date": "April 2022",
		"name": "Malcolm",
		"content": "Owl Cottage is beautiful inside and out. We would highly recommend to anyone wanting a home from home. It gives you some seclusion from everything yet close to all the attractions. Jane was very helpful and thoughtful for our stay and kept in touch with us via email."
	},
	{
		"id": "6",
		"date": "April 2022",
		"name": "Stacy",
		"content": "Lovely cottage, easy to move about to visit places. Warm welcome touches on arrival and plenty of info to help with our stay. Would definitely visit again."
	},
	{
		"id": "5",
		"date": "April 2022",
		"name": "Morag"
	},
	{
		"id": "4",
		"date": "November 2021",
		"name": "Martin"
	},
	{
		"id": "3",
		"date": "October 2021",
		"name": "James",
		"content": "Lovely cottage to explore the highlands from. Everything you need for a cost and comfy stay. 🙂"
	},
	{
		"id": "2",
		"date": "October 2021",
		"name": "Chazos",
		"content": "Wildlife on your doorstep deer birds of prey all around. the back road to Inverness has got amazing view b862, if you have a dog go for a meal at the dores pub in dores next to the beach food out of this world. Enjoy"
	},
	{
		"id": "1",
		"date": "October 2021",
		"name": "Charlotte",
		"content": "I fell in love with this cottage the moment I walked in through the front door - I didn't want to leave! Really well equipped and the most dog friendly cottage I think I have stayed at. Another reviewer commented about not being able to walk from the door, which is true, but there are so many nice walks less than 10 mins drive away that it didn't matter. Nice big bed and super comfy!"
	},
	{
		"id": "0",
		"date": "September 2021",
		"name": "Dave"
	}
]
