[
	{
		"id": "86",
		"date": "May 2024",
		"location": "Hickling, United Kingdom",
		"name": "Carol",
		"content": "Owl Cottage was just perfect for our 4 night stay to explore the area. Spotlessly clean, lovely bed linen and towels, exceptional kitchen equipment. We have stayed in many holiday lets over the years and Owl Cottage has been one of the best... the attention to detail to make your stay comfortable was exceptional. Thank you Jane for a wonderful stay."
	},
	{
		"id": "86",
		"date": "May 2024",
		"location": "United Kingdom",
		"name": "Tanya",
		"content": "My second stay at Owl Cottage. Such a lovely property, good base for lots of exploring. Will definitely be back."
	},
	{
		"id": "85",
		"date": "April 2024",
		"location": "Dorchester, United Kingdom",
		"name": "Kelly",
		"content": "We all had an absolutely wonderful stay at Owl Cottage. The cottage had everything we needed, and as a family, we especially enjoyed the range of games and puzzles on offer. We also loved coming home after a busy day exploring and cosying up by the log burner each evening. Jane is a very attentive and responsive host and answered any questions we had immediately. We couldn't fault her communication throughout, from booking right through to the end of our stay. We really enjoyed our first time in Scotland and particularly enjoyed being able to access a wide range of activities that the Highlands have to offer from the great location of Owl cottage. We would happily highly recommend this cottage to family and friends!"
	},
	{
		"id": "84",
		"date": "April 2024",
		"location": "United Kingdom",
		"name": "Jenna",
		"content": "Fantastic accommodation just perfect for our stay in the highlands. Owl cottage is a beautiful home away from home with everything you could think of for a holiday away. A perfect comfy, cosy cottage. We all loved it! Thank you."
	},
	{
		"id": "83",
		"date": "March 2024",
		"location": "United Kingdom",
		"name": "Helen",
		"content": "Absolute gem of a place! So lucky this was available for our short stay. Great garden for Monty our dog, wonderful location - don't feel like we even scratched the surface of things to do out and about. And to come back to such a lovely cottage with a log burner and a wee dram to cosy in to. Thank you Jane!"
	},
	{
		"id": "82",
		"date": "March 2024",
		"location": "Swadlincote, United Kingdom",
		"name": "Emily",
		"content": "Perfect, peaceful and relaxing!"
	},
	{
		"id": "81",
		"date": "March 2024",
		"location": "Netherlands",
		"name": "Nicholas",
		"content": "A lovely clean home from home. The property had everything we could have needed for a week away. Easy to control heating which made staying there such a pleasure. Loved the blankets so our furry friend could relax next to us to after a busy day discovering Scotland . A truly lovey place to stay."
	},
	{
		"id": "80",
		"date": "March 2024",
		"location": "United Kingdom",
		"name": "Bridget",
		"content": "We all enjoyed an absolutely amazing time at Owl Cottage, our doggies loved the peaceful serenity of the fully enclosed garden and spent most of their time chilling outside. The cottage is very well equipped and has a truly lovely ambiance. We are looking forward to visiting again in the near future 😊."
	},
	{
		"id": "79",
		"date": "March 2024",
		"location": "England, United Kingdom",
		"name": "Gabriella",
		"content": "We stayed at Owl Cottage with our two dogs to explore the local area. Even though the cottage is on a main road, it is quiet enough to feel secluded and cosy. It’s a perfect location to visit Glencoe and Loch Ness area. The cottage has everything you could need and ideal for dogs too with a great garden space. Jane has thought of every detail and we wish we could have stayed longer!"
	},
	{
		"id": "78",
		"date": "February 2024",
		"location": "Wallasey, United Kingdom",
		"name": "Susy",
		"content": "We stayed at Owl Cottage with our two dogs to explore the local area. Even though the cottage is on a main road, it is quiet enough to feel secluded and cosy. It's a perfect location to visit Glencoe and Loch Ness area. The cottage has everything you could need and ideal for dogs too with a great garden space. Jane has thought of every detail and we wish we could have stayed longer!"
	},
	{
		"id": "77",
		"date": "February 2024",
		"location": "York, Pennsylvania",
		"name": "Paula",
		"content": "Just back from a fabulous week's stay at Owl Cottage. From booking to checking in everything was clear and precisely straightforward. The description of Owl Cottage and its facilities were spot on! The cottage is super cosy and comfortable, the location was perfect for us to get away and chill. It was also a great stay for our dogs, they loved having the enclosed back garden to play about in and the doggo blankets and treats helped too. Every day after exploring the area it was great to come back to Owl Cottage, pull on the curtains, get the log burner going and partake in a glass or two of fizz - just perfect!!!! We really can't fault Owl Cottage or Jane, definitely 100/10 from us 👍🎉😍"
	},
	{
		"id": "76",
		"date": "January 2024",
		"location": "England, United Kingdom",
		"name": "Dani",
		"content": "Jane couldn't have offered us a nicer place to stay. Communication was fantastic, the home is really well equipped, it was warm and cozy, especially when we lit the fire! Our puppy loved being able to run about in house and garden."
	},
	{
		"id": "75",
		"date": "January 2024",
		"location": "Swindon, United Kingdom",
		"name": "Marta",
		"content": "Absolutely amazing place worth every single penny. Cottage is exactly as described if not better. So clean and has everything you need. Jane is also so quick to respond to any questions and we couldn't of been happier with our stay! Highly recommend to anyone."
	},
	{
		"id": "74",
		"date": "December 2023",
		"location": "Newcastle upon Tyne, United Kingdom",
		"name": "Georgia",
		"content": "We stayed at Jane's place for 4 nights with a dog. The property is super cozy and kitted out with absolutely everything you need - including basic kitchen supplies, doggy bed/treats and a full starter pack for the log burner. It's cold in Dec but when I arrived late Sunday Jane had made sure the place was warm and well lit. The place was clean, modern and beautifully furnished. I worked remotely all week and the wifi was superb - no issues. There are lots of walks nearby and outdoor space around the property for a dog. You will need to drive to get to walking spots as no footpaths along the main roads. A faultless stay, thank you!"
	},
	{
		"id": "73",
		"date": "December 2023",
		"location": "Mayfield, United Kingdom",
		"name": "Ann",
		"content": "We stayed at Owl Cottage for a few days. It's an absolutely beautiful cottage with everything you need. The added extras were welcomed such as coffee pods and a few logs for the fire. The beds are really comfortable. We have dogs, therefore the enclosed garden was perfect. I'd definitely recommend a visit."
	},
	{
		"id": "72",
		"date": "December 2023",
		"location": "United Kingdom",
		"name": "Kirsty",
		"content": "We had a wonderful stay here with our dog. Peaceful and relaxing with everything you need in a home away from home. Very tastefully decorated and lovely and warm inside. Loved all the extra dog blankets so that our pup could feel at home, too! Would happily recommend!"
	},
	{
		"id": "71",
		"date": "November 2023",
		"location": "Scotland, United Kingdom",
		"name": "George",
		"content": "Owl Cottage is a very cosy comfortable place to stay and a great base to explore and enjoy the local area. Loads to do and see locally. Highly recommended!"
	},
	{
		"id": "70",
		"date": "November 2023",
		"location": "Garlieston, United Kingdom",
		"name": "Tracy",
		"content": "We have had a fantastic time away this Autumn, such a lot to see and do. Owl cottage was warm and cozy, plenty of space for us and our dogs. Set back off the road and quiet. The power shower was a treat after a day out and about. The Falls of Foyer was not too far away but a good hike down to Loch Ness and back up. The wee cafe was perfect for a late lunch and coffee. Glenfinnin is a must visit!!! The Harry Potter train is fantastic to see!! Ben Nevis visitor centre didn't disappoint, the cable car up to the lookout area and ski cafe was fun. All in all a wonderful holiday in the highlands!! And each night to return to a warm cottage to make dinner and sit in front of the fire was a treat!!!"
	},
	{
		"id": "69",
		"date": "October 2023",
		"location": "Wales, United Kingdom",
		"name": "Lyn",
		"content": "Once again a superb stay at Owl Cottage where Jane has gone the extra mile to make sure everything you could possibly need is on tap. It's pristine, comfortable and extremely well equipped; it's also perfectly placed for exploring one of the most spectacular parts of Scotland - we still haven't run out of fabulous walks to do - we're already planning when we'll be back again!"
	},
	{
		"id": "68",
		"date": "October 2023",
		"location": "England, United Kingdom",
		"name": "Louise",
		"content": "Great host and wonderful accommodation!"
	},
	{
		"id": "67",
		"date": "September 2023",
		"location": "Bordeaux, France",
		"name": "Marion",
		"content": "Very clean and very spacious cottage, if you are looking for tranquility and a typical place of the highlands this is the accommodation you need! This cottage in the middle of nature and close to Fort Augustus was the place we were looking for when we wanted to do our roadtrip in Scotland. Jane is responsive when sent a message. Only drawback may be, a connection that is unstable, but is consistent with the place!"
	},
	{
		"id": "66",
		"date": "September 2023",
		"location": "London, United Kingdom",
		"name": "Ellena",
		"content": "Lovely cottage in the heart of Highlands. Great location to get to Loch Ness and lots of the sights of the Highlands within an hour or twos drive. Peaceful surroundings, with the cottage set back from the road. Fort Augustus is lovely and we enjoyed our holiday very much"
	},
	{
		"id": "65",
		"date": "September 2023",
		"location": "Bodegraven, Netherlands",
		"name": "Wolter",
		"content": "The place was great and had everything we needed. The only thing that we would like to have seen better was the internet but that is understandably very difficult to do well in such a remote place."
	},
	{
		"id": "64",
		"date": "August 2023",
		"location": "Kintore, United Kingdom",
		"name": "Ava",
		"content": "Beautiful house in a great location. Very spacious and has everything you need for a few days away. Great garden, which is fully enclosed for the dog too."
	},
	{
		"id": "63",
		"date": "August 2023",
		"location": "United Kingdom",
		"name": "Erin",
		"content": "Had another lovely stay at Owl Cottage, had the added bonus of a newly refurbished bathroom this year. The cottage is VERY spacious and the super king size bed is always a winner. Spotlessly clean and all the amenities you need to make it home from home. The cooking facilities are perfect and we love the oven. The view from the cottage is beautiful, stunning rainbows the other morning. Great location if you want to go further north to Inverness and further or south to Glencoe and only a very short drive to Fort Augustus. Jane is very responsive to any questions and always happy to help. All in all, another fantastic stay."
	},
	{
		"id": "62",
		"date": "August 2023",
		"location": "Dalgety Bay, United Kingdom",
		"name": "Jennifer",
		"content": "Beautiful cottage, absolutely perfect for dogs and humans. Close enough to shops and ‘things to do’ but far enough to feel like we were in the middle of nowhere. Exactly what we needed."
	},
	{
		"id": "61",
		"date": "August 2023",
		"location": "United Kingdom",
		"name": "Steven",
		"content": "Would recommend Owl Cottage! The whole family loved it. My 3 year old daughter wanted to “stay at Owl Cottage forever”. It was a nice place to relax and spend time in, but also well placed to explore the surrounding areas. Jane was very responsive and helpful. If going with dogs would recommend the jaggy thistle for breakfast and the whitebridge hotel for dinner."
	},
	{
		"id": "60",
		"date": "August 2023",
		"location": "Nantes, France",
		"name": "Yohann",
		"content": "Superb stay in Jane's cottage, perfect for a family of 4, very well equipped, very comfortable, quiet, a high quality service!"
	},
	{
		"id": "59",
		"date": "August 2023",
		"location": "Deinze, Belgium",
		"name": "Gino",
		"content": "Great place to stay!"
	},
	{
		"id": "58",
		"date": "July 2023",
		"location": "Edinburgh, United Kingdom",
		"name": "Yu-Ting",
		"content": "Everything was very lovely in the house - we really enjoyed our stay!"
	},
	{
		"id": "57",
		"date": "July 2023",
		"location": "Dresden, Germany",
		"name": "Jenny",
		"content": "The place was wonderful and there was information material ready for us. Everything was available and communication with Jane went smoothly. Unfortunately, the apartment is on a main road and there is no footpath to the nearest neighboring village. I would definitely recommend it. Thank you for the lovely holiday 😊"
	},
	{
		"id": "56",
		"date": "July 2023",
		"location": "Holton, United Kingdom",
		"name": "James",
		"content": "As described and a comfortable cottage that easily accommodated 4, plus a dog."
	},
	{
		"id": "55",
		"date": "July 2023",
		"location": "Rosyth, United Kingdom",
		"name": "Lesley",
		"content": "Lovely property, very pet friendly."
	},
	{
		"id": "54",
		"date": "June 2023",
		"location": "Gunzenhausen, Germany",
		"name": "Judith",
		"content": "Absolutely stunning cottage, great location with many walking opportunities in the area. The cottage was very clean and had everything we needed, we felt right at home and would come back again any time. Jane was a great host who responded very quickly to all my questions. Definitely a 5 star experience"
	},
	{
		"id": "53",
		"date": "June 2023",
		"location": "West Chester, Pennsylvania",
		"name": "Paul",
		"content": "Nice place, worked well for my family."
	},
	{
		"id": "52",
		"date": "June 2023",
		"location": "United Kingdom",
		"name": "Tanya",
		"content": "Just got back from a couple of days in Jane's cottage and all I can say is wow. The place is immaculate and had everything we needed. the dogs had a wonderful time in the garden which is really secure ,they even met the neighbour. everything is within easy driving distance and Fort Augustus has all you need for a few days sightseeing. culloden Moor is about an hour away and really worth the drive as is InvernessThe local Spar shop has everything you need for local produce. Will be booking again for next year."
	},
	{
		"id": "51",
		"date": "June 2023",
		"location": "United Kingdom",
		"name": "Emma",
		"content": "If you are looking for a cozy cottage then this is a great place to stay. The location is just set back off the A82 which makes it easy to find. Jane also provided me information and web links of different dog walks. Over all a really nice stay and a great long weekend away."
	},
	{
		"id": "50",
		"date": "May 2023",
		"location": "Assendelft, Netherlands",
		"name": "Anne",
		"content": "We had the opportunity to stay for a few days in this spacious and pleasantly located accommodation. From the house, you could explore in any direction, and it was centrally located in beautiful nature."
	},
	{
		"id": "49",
		"date": "May 2023",
		"location": "Münster, Germany",
		"name": "Jan",
		"content": "The accommodation is highly recommended. Everything you need. Garden super suitable for a dog. Accommodation is very well-equipped and is centrally located for various activities by car within an hour."
	},
	{
		"id": "48",
		"date": "May 2023",
		"location": "Pfungen, Switzerland",
		"name": "Jan",
		"content": "Nice cottage in a good location."
	},
	{
		"id": "47",
		"date": "April 2023",
		"location": "Wales, United Kingdom",
		"name": "Lyn",
		"content": "Absolutely superb. Fabulous, tasteful, pristine accommodation with everything you could possibly need, in the perfect spot for the most amazing walks and scenery. Can't wait to come again!"
	},
	{
		"id": "46",
		"date": "April 2023",
		"location": "Burwell, United Kingdom",
		"name": "Louise",
		"content": "Beautiful cottage in a great location. It was super clean and had everything we needed. We wish we could have stayed longer."
	},
	{
		"id": "45",
		"date": "April 2023",
		"location": "Newport, United Kingdom",
		"name": "Kathryn",
		"content": "This cottage is just lovely. Roomier inside than you expect and well located for local activities. It is well equipped, beds are comfy and it is spotlessly clean. Definitely book."
	},
	{
		"id": "44",
		"date": "April 2023",
		"location": "Saxmundham, United Kingdom",
		"name": "Dani",
		"content": "Really loved our stay at Owl Cottage! Great location near Fort Augustus and perfect base to explore the highlands. We felt at home right away. Spotlessly clean and had everything we could need. Would definitely recommend Jane's place!"
	},
	{
		"id": "43",
		"date": "April 2023",
		"location": "London, United Kingdom",
		"name": "Phil",
		"content": "This is a fantastic location with a great host. Jane was very responsive when we had enquiries and the house was clean , stylish, comfortable and practicle. The house is on the A82 between Fort William and Inverness, but is nicely set back from the road. Passing traffic was minimal whilst we were there, and never disturbed us. Nice views across the glen to the front and a bracken covered hill to the back with occassional deer. Back garden is fenced in, so safe to release our little Border Terrier into. We used the location as a base to explore across the highlands, down to Glencoe and the Skyfall road which is a must. Malaig and Skye on the west coast and Loch Ness and the Cairngorms north and east. it's a 4 minute drive up to Fort Augustus where you have a few food options and a well equiped general store at the petrol Station, which had the cheapest fuel out side of Inverness. There were lots of lovely walks within a short drive. Wonderful holiday :)"
	},
	{
		"id": "42",
		"date": "March 2023",
		"location": "Scotland, United Kingdom",
		"name": "Catriona",
		"content": "Really great little cottage it had everything we could have asked for. It was great be able to let the dog wander about without worrying where she was in the house. Great living space, bed was lovely, big and comfy. Kitchen/dining/living area was nice and spacious and great for meal times and games too. If in the area again will definitely book again."
	},
	{
		"id": "41",
		"date": "February 2023",
		"location": "United Kingdom",
		"name": "Graham",
		"content": "I would highly recommend Janes cottage."
	},
	{
		"id": "40",
		"date": "February 2023",
		"location": "Sutton, United Kingdom",
		"name": "Grant",
		"content": "Lovely place, warm, spacious yet cosy. The garden was perfect for dogs. Kitchen, dining and front room layout was perfect for family meals and board games. Close to many beautiful walks, the cottage was well equipped, with a log burner. the home was lovely and warm. 6 mins drive to shop which had most things. Great pub in Fort Augustus. We had a wonderful peaceful stay."
	},
	{
		"id": "39",
		"date": "January 2023",
		"location": "Astoria, Oregon",
		"name": "Jenny & Myshkin",
		"content": "We love this beautiful place! We are so grateful that we found it, l it had everything we needed. Jane is a wonderful host."
	},
	{
		"id": "38",
		"date": "January 2023",
		"location": "Lancaster, United Kingdom",
		"name": "Laura",
		"content": "We've just returned from a 4 night stay at Owl Cottage and everything was perfect. The cottage is lovely; really spacious, cosy and so well equipped. We had 3 dogs with us and the large, enclosed garden was perfect for them. Jane's a great host - very quick at responding to messages and answering any questions we had. The cottage is in a fantastic location and we will definitely return in the future!"
	},
	{
		"id": "37",
		"date": "November 2022",
		"location": "United Kingdom",
		"name": "Christina",
		"content": "Lovely, comfortable home, good communication and east check in. Lovely area to stay in with lots to do nearby. Would definitely recommend to stay here."
	},
	{
		"id": "36",
		"date": "November 2022",
		"location": "Edinburgh, United Kingdom",
		"name": "Ben",
		"content": "The perfect place to relax and switch off from city life. The cottage was beautifully presented and we felt right at home. Our dog Mabel loved it too. The enclosed garden out the back was perfect for her. Would definitely recommend and would stay again!"
	},
	{
		"id": "35",
		"date": "November 2022",
		"location": "London, United Kingdom",
		"name": "Marie",
		"content": "Owl Cottage is a top notch accommodation. It is spacious, pristine and thoughtfully laid out. Jane provides good quality bedding and a very comfortable mattress to ensure a great sleep. The kitchen is so well equipped and will please all avid cooks, with a lovely large oven and a good assortments of pots and pans. 100 percent recommend Owl Cottage!"
	},
	{
		"id": "34",
		"date": "November 2022",
		"location": "France",
		"name": "Elodie",
		"content": "Great stay at this very cozy cottage. Jane is very responsive and replies quickly to messages. Recommended!"
	},
	{
		"id": "33",
		"date": "October 2022",
		"location": "United Kingdom",
		"name": "Kevin",
		"content": "We had a great stay here in a lovely property. We had everything we required and great communication with the host. Beautiful location and great we could bring our dog!"
	},
	{
		"id": "32",
		"date": "October 2022",
		"location": "United Kingdom",
		"name": "Chris",
		"content": "Lovely cottage just a short drive from Fort Augustus. Would highly recommend for a family and the fact that it's dog friendly is a real plus."
	},
	{
		"id": "31",
		"date": "October 2022",
		"location": "United Kingdom",
		"name": "Kirstie",
		"content": "A lovely cottage with everything we needed to relax, in between exploring the local area... just great!"
	},
	{
		"id": "30",
		"date": "October 2022",
		"location": "United Kingdom",
		"name": "Neil",
		"content": "Excellent cottage all finished off to a high standard, ideally situated between Inverness and Fort William. Even though it's near a main road, there is very little road traffic 3 miles from Fort Augustus."
	},
	{
		"id": "29",
		"date": "September 2022",
		"location": "Cambridge, United Kingdom",
		"name": "Alysha",
		"content": "Fantastic stay! I couldn't have been made to feel more welcome. The property is in a great location to explore the highlands with stunning views. It was clean and had everything needed to make a comfortable stay. Highly recommend!!!"
	},
	{
		"id": "28",
		"date": "September 2022",
		"location": "United Kingdom",
		"name": "Natalie",
		"content": "Beautiful cottage in a stunning location. Very dog friendly with dog bed, bowls, toys and a fully enclosed garden. Easy car ride away to all the different landscapes of the Highlands from beaches to woodland, waterfalls to mountains."
	},
	{
		"id": "27",
		"date": "September 2022",
		"location": "United Kingdom",
		"name": "Katie",
		"content": "We had a great stay with our family and having the dogs be able to access everywhere securely was just amazing and took any stress out of being away from home for them!"
	},
	{
		"id": "26",
		"date": "September 2022",
		"location": "United Kingdom",
		"name": "Susan",
		"content": "A comfy cottage, don't be put off as we nearly were that there are no walks from the door, a 10-minute drive and there are plenty. We had everything we needed and the scenery is just stunning."
	},
	{
		"id": "25",
		"date": "September 2022",
		"location": "Liverpool, United Kingdom",
		"name": "Rob",
		"content": "Owl cottage was a great base for our daily outings, we would recommend it to anyone that's looking for an active break."
	},
	{
		"id": "24",
		"date": "August 2022",
		"location": "Birmingham, United Kingdom",
		"name": "Tom",
		"content": "Owl cottage was fabulous and Jane was so accommodating allowing us to arrive early. The cottage layout is perfect for a family and so cosy with the log fire. The location was great too with it only being a short trip into Fort Augustus. The highlight though was getting two Pine Martin visitors into the garden at dusk… both me and my wife and the kids were thrilled to see them as they can be difficult to see (tip, they like custard creams)….."
	},
	{
		"id": "23",
		"date": "August 2022",
		"location": "Oxford, United Kingdom",
		"name": "Martin",
		"content": "Jane's cottage was fantastic. In a perfect location just south of Loch Ness but within easy access to the Nevis Range, Fort William etc… Had everything we needed as a family and Jane was very helpful and communicative. We highly recommend staying here if you plan on visiting the area."
	},
	{
		"id": "22",
		"date": "August 2022",
		"location": "United Kingdom",
		"name": "Paula",
		"content": "Owl cottage is the best cottage we've stayed at for a long time! 10/10 for everything and an ideal spot to explore Loch Ness and beautiful villages on the way to Inverness! 🏴󠁧󠁢󠁳󠁣󠁴󠁿"
	},
	{
		"id": "21",
		"date": "August 2022",
		"location": "United Kingdom",
		"name": "Erin",
		"content": "Great cottage, so airy, spacious and comfy. Everything you need there to call it a home from home for your stay. Our sons highlight was the 4 fighter jets in training that flew past the cottage on Tuesday morning. Lovely comfy super king sized bed. Really enjoyed our stay and have booked a return visit. communication with Jane has been great, self checkin super easy and cottage was lovely and clean with Tunnocks teacakes, milk, tea and coffee to greet us. Thank you."
	},
	{
		"id": "20",
		"date": "July 2022",
		"location": "Rawcliffe Bridge, United Kingdom",
		"name": "Nina",
		"content": "Beautiful Cottage. Absolutely spotless. Superb quality fixtures and fittings. Jane went out of her way to ensure our stay was outstanding. Stunning area."
	},
	{
		"id": "19",
		"date": "July 2022",
		"location": "Rushmere Saint Andrew, United Kingdom",
		"name": "Alice",
		"content": "Wow! Such a lovely place to stay. You definitely wouldn't know from noise that you're on a main road but makes the cottage ideal when trying to get to places. So well equipped, very clean and just all round so comfortable. Thank you for having us - we will be back for sure :)"
	},
	{
		"id": "18",
		"date": "July 2022",
		"location": "Scotland, United Kingdom",
		"name": "Lynsey",
		"content": "Lovely big cottage. Very welcoming. Clean and cosy. Little personal touches, like tea and coffee, coffee pods, biscuits and milk provided on arrival. Great location. Would definitely book again."
	},
	{
		"id": "17",
		"date": "July 2022",
		"location": "Gwespyr, United Kingdom",
		"name": "William",
		"content": "My wife, our two dogs and I have just got back from spending a week at Owl Cottage. We loved everything about it. Such a beautiful cottage in idyllic surroundings. We loved the open plan kitchen and living area and even though it mentions occasional traffic noise in the description, we didn't notice it as the road isn't busy. The Cottage was cleaned to a high standard and had all the facilities and cooking equipment we needed. We were very happy there and we can't fault it at all. It was the perfect place for us to explore the Highlands with Fort Augustus and Loch Ness only 5 minutes drive away and so many walks exploring the beautiful surroundings a short distance away too. The garden was great for the dogs and was all enclosed so they were quite happy roaming around. Jane is a great host with brilliant communication and made our stay very easy. I'd highly recommend staying at Owl Cottage and we will definitely be back to stay again."
	},
	{
		"id": "16",
		"date": "June 2022",
		"location": "Coulby, Newham, United Kingdom",
		"name": "Emma",
		"content": "Owl Cottage was perfect - spotlessly clean and spacious with everything we needed and more! Jane was a great host and communication was very easy. The cottage was in a great location, just a short drive to some beautiful attractions. I would highly recommend a stay at Owl Cottage."
	},
	{
		"id": "15",
		"date": "June 2022",
		"location": "Prestwich, United Kingdom",
		"name": "Neil",
		"content": "Fantastic cottage in a beautiful location"
	},
	{
		"id": "14",
		"date": "June 2022",
		"location": "Middle Barton, United Kingdom",
		"name": "Joanne",
		"content": "We had a great stay in this wonderful dog friendly cottage. We took three dogs and it was perfect for them with a lovely enclosed garden (the fence is high enough for our terriers not to scale but we didn't leave our young collie unattended in the garden just in case!) and wooden floors throughout. There isn't any walking from the cottage but there are some fabulous walks a short drive away (including one along the Caledonian canal about 5 mins drive away which was great for the dogs!)"
	},
	{
		"id": "13",
		"date": "June 2022",
		"location": "United Kingdom",
		"name": "Tanya",
		"content": "We had a fantastic stay at Owl Cottage. An easy check-in. The cottage was clean and comfortable and had everything needed to make this the perfect home from home stay. Beautiful cottage in a perfect location with lots of walks and sights just a short drive away. Will definitely stay in this cottage again and would recommend to anyone looking to visit the Highlands."
	},
	{
		"id": "12",
		"date": "May 2022",
		"location": "England, United Kingdom",
		"name": "James",
		"content": "We loved our week at Owl Cottage! It's a pretty remote location, which really worked for us, but may be a drawback for some. It's about an hour's drive to Inverness, half an hour to Fort William, but thankfully only a few minutes to Fort Augustus which has fuel and a decent shop. There's plenty to do in the local area, in terms of walking and cycling. We went for breakfast at the local Jaggy Thistle café which we'd highly recommend. Simple food, friendly staff, and a lovely dog called Barney!"
	},
	{
		"id": "11",
		"date": "May 2022",
		"location": "Edinburgh, United Kingdom",
		"name": "Kieth",
		"content": "A great spacious, but cosy, get away from it all. Would definitely stay again."
	},
	{
		"id": "10",
		"date": "May 2022",
		"location": "United Kingdom",
		"name": "Jozie",
		"content": "Beautifully presented cottage in the heart of the Highlands. Super dog friendly, the perfect place for a relaxing getaway."
	},
	{
		"id": "9",
		"date": "May 2022",
		"location": "Salisbury, United Kingdom",
		"name": "Sam",
		"content": "Loved the house. Beautiful on inside and out. Would visit again. Perfectly located for Loch Ness and Ben Nevis. An old property but still very modern."
	},
	{
		"id": "8",
		"date": "April 2022",
		"location": "Happisburgh, United Kingdom",
		"name": "Steve",
		"content": "A great cottage - well equipped and beautifully furnished. Also ideal if you have dogs-wooden floors and an enclosed garden. We found it a good central position for our first visit to the Highlands. We would definitely recommend it."
	},
	{
		"id": "7",
		"date": "April 2022",
		"location": "England, United Kingdom",
		"name": "Malcolm",
		"content": "Owl Cottage is beautiful inside and out. We would highly recommend to anyone wanting a home from home. It gives you some seclusion from everything yet close to all the attractions. Jane was very helpful and thoughtful for our stay and kept in touch with us via email."
	},
	{
		"id": "6",
		"date": "April 2022",
		"location": "United Kingdom",
		"name": "Stacy",
		"content": "Lovely cottage, easy to move about to visit places. Warm welcome touches on arrival and plenty of info to help with our stay. Would definitely visit again."
	},
	{
		"id": "5",
		"date": "April 2022",
		"location": "United Kingdom",
		"name": "Morag",
		"content": "Lovely cottage, clean, spacious and great location."
	},
	{
		"id": "4",
		"date": "November 2021",
		"location": "Chesterfield, Missouri",
		"name": "Martin",
		"content": "Great cottage and Location very clean tidy and I host Jane very accommodating. Thanks."
	},
	{
		"id": "3",
		"date": "October 2021",
		"location": "Whitstable, United Kingdom",
		"name": "James",
		"content": "Lovely cottage to explore the highlands from. Everything you need for a cost and comfy stay. 🙂"
	},
	{
		"id": "2",
		"date": "October 2021",
		"location": "Blyton, United Kingdom",
		"name": "Chazos",
		"content": "Wildlife on your doorstep - deer, birds of prey all around. The B862 road to Inverness has got breathtaking views. If you have a dog, go for a meal at the Dores Inn next to the beach - food out of this world. Enjoy!"
	},
	{
		"id": "1",
		"date": "October 2021",
		"location": "England, United Kingdom",
		"name": "Charlotte",
		"content": "I fell in love with this cottage the moment I walked in through the front door - I didn't want to leave! Really well equipped and the most dog friendly cottage I think I have stayed at. Another reviewer commented about not being able to walk from the door, which is true, but there are so many nice walks less than 10 mins drive away that it didn't matter. Nice big bed and super comfy!"
	},
	{
		"id": "0",
		"date": "September 2021",
		"location": "Preston, United Kingdom",
		"name": "Dave",
		"content": "Beautiful Holiday cottage, brilliant location, and worth every penny, the pictures don't do it justice. It's very homely, welcoming, with thoughtful added extras for free. Good We had some great walks, the dog loved it, secure garden, 7 miles to local village/loch ness/fort Augustus. Deffo recommend 👍🏻"
	}
]
